
# üß© Titanic Dataset Exploration with pandas

üéØ **Goal:**  
In this notebook, you'll explore the Titanic dataset using **pandas**.  
You'll practice the most common pandas functions for data inspection, selection, filtering, cleaning, and analysis.

For each function in the list below:
1. Explain what it does (in your own words, in a Markdown cell).
2. Give at least **two examples** using the Titanic dataset.
3. Add a short comment about the output or why it‚Äôs useful.

In [33]:

import pandas as pd

def separacion():
    print("---------------------------------------------------------------")

# Load Titanic dataset
# (Make sure titanic.csv is in the same folder as this notebook)
df = pd.read_csv("titanic_dataset.csv")

# Show first few rows
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S


## üß† Step 1: Inspecting the Data

Functions to explore:
- df.head()
- df.tail()
- df.info()
- df.describe()
- df.shape
- df.columns

Con df.head() podemos mostrar las primeras 5 filas de nuestro csv.
Podemos cambiar el n√∫mero de filas que mostrar√° a√±adiendole un n√∫mero entre los par√©ntesis.

In [35]:

# Example: df.head()
df.head()
# Al intentar ejecutar solo la l√≠nea anterior no se mostrar√° nada, puesto que python solo mostrar√° la √∫ltima funci√≥n de la celda, para visualizarla haremos lo siguiente:
display(df.head())
# df.head() nos mostrar√° las 5 primeras filas mientras no le pasemos ning√∫n dato
# Example 2
display(df.head(10))
# df.head(10) nos mostrar√° las 10 primeras filas

# df.head() nos es √∫til para mostrar datos y tambi√©n para comprobar que el csv se carg√≥ correctamente

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

Con df.tail() mostraremos las √∫ltimas filas del csv. Funciona muy similar a head.
En base a sus nombres podemos asumir para que sirve cada uno; head=cabeza, tail=cola.
Como pasa con el df.head() podemos indicar un n√∫mero espec√≠fico de filas a mostrar.

In [36]:
# Example: df.tail()
display(df.tail())
# df.head() nos mostrar√° las 5 primeras filas mientras no le pasemos ning√∫n dato
# Example 2
display(df.tail(10))
# df.head(10) nos mostrar√° las 10 primeras filas

# df.head() nos es √∫til para mostrar los datos finales del csv-

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Con df.info() podemos mostrar una especie de resumen de nuestro csv.

In [ ]:
# Example: df.info()

# Ejemplo 1: Informaci√≥n completa del dataset
df.info()

# Ejemplo 2: Podemos "filtrar" datos con √©l, en este caso mostrar√° un resumen de los pasajeros que tengan m√°s de 30 a√±os
df_filtered = df[df['Age'] > 30]
df_filtered.info()
# En este caso hemos guardado los datos "filtrados en otro data frame y luego mostramos su informati√≥n"

# Nos sirve para ver que tipo de datos hay en nuestro csv y tambi√©n para ver la cantidad de nulos que hay en el mismo.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
<class 'pandas.core.frame.DataFrame'>
Index: 305 entries, 1 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  305 non-null    int64
 1   Survived     305 non-null    int64
 2   Pclass       305 non-null    int64
 3   Name         305 non-null    object
 4   Sex          305 non-null    object
 5   Age          305 non-null    float64
 6   SibSp        305 non-null    int64
 7   Parch        305 non-null    int64
 8   Ticket       305 non-null    object
 9   Fare         305 non-null    float64
 10  Cabin        116 non-null    object
 11  Embarked     303 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 31.0+ KB

Con df.describe() podemos mostrar estad√≠sticas sencillas de las columnas de nuestro csv.
Obviamente necesitamos que las columnas posean datos n√∫mericos.

In [ ]:
# Example: df.describe()

# Ejemplo 1: Estad√≠sticas de columnas num√©ricas
df.describe()

# Ejemplo 2: Incluir todas las columnas (num√©ricas y categ√≥ricas)
df.describe(include='all')

# describe tiene m√°s par√°metros, por ejemplo; "percentile=" (los porcentajes que incluir√° en la salida), "include=" (puede tener 3 opciones y espec√≠fica los data types que incluir√°), "exclude=" (es lo mismo que include pero a la inversa, pero este no puede tener all)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

df.shape nos devuelve una tupla en la que indica la dimension de nuestro data frame

In [ ]:
# Example: df.shape()

# Ejemplo 1: Ver la forma del dataset
display(df.shape)

# Ejemplo 2: Comparar forma antes y despu√©s de eliminar filas nulas con dropna()
df_clean = df.dropna()
display(df_clean.shape)

# Con shape podemos ver si los filtros y cambios que realizamos a gran escala sobre nuestro data frame tiene efecto o no

(891, 12)

(183, 12)

Con df.colums podemos ver los nombres de todas las columnas de nuestro data frame

In [ ]:
# Example: df.columns()

# Ejemplo 1: Mostrar todas las columnas
display(df.columns)

# Ejemplo 2: Convertir los nombres de columnas a una lista
list(df.columns)

# Lo podemos usar para ver los nombres de nuestras columnas y asegurarnos del nombre de la columna que vayamos a usar en un filtro

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']


## üîç Step 2: Selecting Data

Functions to explore:
- df["column"]
- df[["col1", "col2"]]
- df.loc[]
- df.iloc[]

df["column"] nos permite seleccionar una sola columna de nuestro data frame

In [ ]:

# Example: Selecting columns
display(df["Age"].head())
# display(df["column"].head()) nos muestra los datos de la columna, su nombre y el tipo de datos
display(df[["Age"]].head())
# display(df[["column"]].head()) nos muestra los datos de la columna y su nombre, en un formato mejor presentado

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

    Age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

df[["col1", "col2"]] muestra varias columnas a la vez, el resultado ser√° un nuevo data frame

In [59]:
# Ejemplo 1 que muestra solo el sexo, edades y si sobrevivi√≥ o no de las 5 primeras filas
display(df[["Sex", "Age", "Survived"]].head())

# Ejemplo 2 que muestra solo el sexo, edades y si sobrevivi√≥ o no de las 5 √∫ltimas filas
display(df[["Sex", "Age", "Survived"]].tail())

# Podemos guardar los datos que queramos como un data frame nuevo o mostrar los datos de varias columnas a la vez

      Sex   Age  Survived
0    male  22.0         0
1  female  38.0         1
2  female  26.0         1
3  female  35.0         1
4    male  35.0         0

        Sex   Age  Survived
886    male  27.0         0
887  female  19.0         1
888  female   NaN         0
889    male  26.0         1
890    male  32.0         0

df.loc[] sirve para seleccionar las columnas y filas por nombre o √≠ndice.

In [ ]:
# Ejemplo 1 que selecciona una fila espec√≠fica por √≠ndice, en este caso nos ense√±a al pasajero 0
display(df.loc[0])

# Ejemplo 2 que selecciona filas por condici√≥n y columnas espec√≠ficas, en este caso a las mujeres
display(df.loc[df["Sex"] == "female", ["Name", "Age", "Survived"]])

# Lo podemos usar para filtrar datos o buscar una fila en espec√≠fco

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

                                                  Name   Age  Survived
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0         1
2                               Heikkinen, Miss. Laina  26.0         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0         1
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0         1
9                  Nasser, Mrs. Nicholas (Adele Achem)  14.0         1
..                                                 ...   ...       ...
880       Shelley, Mrs. William (Imanita Parrish Hall)  25.0         1
882                       Dahlberg, Miss. Gerda Ulrika  22.0         0
885               Rice, Mrs. William (Margaret Norton)  39.0         0
887                       Graham, Miss. Margaret Edith  19.0         1
888           Johnston, Miss. Catherine Helen "Carrie"   NaN         0

[314 rows x 3 columns]

Con df.iloc[] podemos seleccionar filas y columnas por su √≠ndice entero

In [68]:
# Ejemplo 1: Selecciona la primera fila (√≠ndice 0), funciona pr√°cticamente igual que df.loc[] cuando se espec√≠fica un √≠ndice
display(df.iloc[0])

# Ejemplo 2: Selecciona las primeras 5 filas y las primeras 3 columnas
display(df.iloc[0:5, 0:3])

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

   PassengerId  Survived  Pclass
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3


## üîé Step 3: Filtering Rows

Functions to explore:
- df[df["Age"] > 30]
- df.query("Sex == 'female' and Survived == 1")

df[df["Age"] > 30] nos permite filtrar filas de nuestro data frame con una condici√≥n l√≥gica.
En el ejemplo de arriba solo seleccionar√° las filas donde la edad sea mayor que 30

In [71]:

# Ejemplo 1: Filtra pasajeros mayores de 50 a√±os y muestra los 5 primeros
display(df[df["Age"] > 50].head())

# Ejemplo 2: Filtra pasajeros mayores de 30 y mostrar solo las columnas que le indicamos
display(df[df["Age"] > 30][["Name", "Age", "Sex", "Survived"]])

# Nos sirve para mostrar datos filtrados, con una o varias condiciones de por medio y de manera sencilla

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C

                                                  Name   Age     Sex  Survived
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female         1
4                             Allen, Mr. William Henry  35.0    male         0
6                              McCarthy, Mr. Timothy J  54.0    male         0
11                            Bonnell, Miss. Elizabeth  58.0  female         1
..                                                 ...   ...     ...       ...
873                        Vander Cruyssen, Mr. Victor  47.0    male         0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0  female         1
881                                 Markun, Mr. Johann  33.0    male         0
885               Rice, Mrs. William (Margaret Norton)  39.0  female         0
890                                Dooley, Mr. Patrick  32.0    male         0

[305 rows x 4 columns]

df.query("Sex == 'female' and Survived == 1").head()df filtra filas mediante una expresi√≥n tipo string.
Es similar a sql (hasta cierto punto).
En el ejemplo de arriba filtrar√° y mostrar√° solo 5 primeras filas de las mujeres que han sobrevivido

In [ ]:
# Ejemplo 1: Mujeres que sobrevivieron
display(df.query("Sex == 'female' and Survived == 1"))

# Ejemplo 2: Hombres en primera clase que no sobrevivieron
display(df.query("Sex == 'male' and Survived == 0 and Pclass == 1"))

# Este tipo de filtrado, en mi opini√≥n, es m√°s f√°cil de entender que el anterior

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0000,B102,S
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,NaN,S
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S


## üßπ Step 4: Handling Missing Data

Functions to explore:
- df.isna()
- df.isna().sum()
- df.dropna()
- df.fillna()

df.isna() nos devuelve un data frame del mismo tama√±o que el original donde cada celda muestra:
- True si el valor est√° vac√≠o
- False si tiene un valor v√°lido

In [80]:
# Ejemplo 1: Mostrar si cada valor es nulo o no
display(df.isna())

# Ejemplo 2: Aplicar isna() solo a la columna de edad
display(df["Age"].isna())

# Nos permite detectar si faltan algunos valores en alguna celda

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

Al combinar df-isna() con .sum() podemos contar cu√°ntos valores nulos hay por columna

In [ ]:
# Ejemplo 1: Contar los valores nulos en cada columna
display(df.isna().sum())

# Ejemplo 2: Contar solo los nulos de la columna edad
display(df["Age"].isna().sum())

# Podemos ver m√°s directamente que columnas tiene m√°s valores nulos

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

177

df.dropna() elimina las filas que tengan valores null

In [83]:
# Ejemplo 1: Eliminar filas con cualquier valor nulo
display(df.dropna())

# Ejemplo 2: Eliminar solo las filas donde falte la edad
display(df.dropna(subset=["Age"]))

# Muy √∫til cuando queramos deshacernos de las columnas que tengan valores nulos

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

df.fillna() nos permite reemplazar los valores null por uno espec√≠fico o por la media, mediana, etc...

In [85]:
# Ejemplo 1: Reemplazar valores nulos de 'Age' por la edad promedio
display(df["Age"].fillna(df["Age"].mean(), inplace=True))

# Ejemplo 2: Reemplazar todos los nulos por 0
display(df.fillna(0))

# Tambi√©n es super √∫til si no queremos borrar datos de nuestro data frame y nos sirve tener la media u otro dato en el lugar de los valores nulos

None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,0,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,0,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,0,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,0,Q


## üìä Step 5: Grouping and Aggregating

Functions to explore:
- df.groupby("Sex")["Survived"].mean()
- df["Fare"].mean()
- df["Age"].median()

En "df.groupby("Sex")["Survived"].mean()", groupby() agrupa todos los datos por una o varias columnas.

In [ ]:
# Ejemplo 1: Promedio de supervivencia por sexo
display(df.groupby("Sex")["Survived"].mean())

# Ejemplo 2: Promedio de supervivencia por clase y sexo
display(df.groupby(["Pclass", "Sex"])["Survived"].mean())

# Nos permite obtener datos con los que podemos hacer comparaciones de forma r√°pida

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

Con df["Fare"].mean() calculamos la media de la columna "Fare"

In [ ]:
# Ejemplo 1: Precio promedio del pasaje
display(df["Fare"].mean())

# Ejemplo 2: Precio promedio del pasaje entre los pasajeros de primera clase
display(df[df["Pclass"] == 1]["Fare"].mean())

# Nos permite ver la media y usarla para comparaciones u otras operaciones que la necesiten

32.204207968574636

84.1546875

df["Age"].median() calcula la mediana (el valor del medio) de la columna edad.

In [ ]:
# Ejemplo 1: Edad mediana de todos los pasajeros
display(df["Age"].median())

# Ejemplo 2: Clase mediana de los pasajeros
display(df["Pclass"].median())

# Nos permite conocer la mediana de manera super r√°pid

29.69911764705882

3.0


## üìà Step 6: Sorting and Counting

Functions to explore:
- df.sort_values("Age")
- df["Sex"].unique()
- df["Pclass"].value_counts()

df.sort_values("Age") ordena las filas de nuestro data frame seg√∫n los valores de una o varias columnas.

In [96]:
# Ejemplo 1: Ordenar por edad de menor a mayor
display(df.sort_values("Age"))

# Ejemplo 2: Ordenar por edad de mayor a menor
display(df.sort_values("Age", ascending=False))

# Nos permite visualizar de manera ascendente o descendete las columnas que queramos, ordenadas por un valor

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
116,117,0,3,"Connors, Mr. Patrick",male,70.50,0,0,370369,7.7500,NaN,Q
96,97,0,1,"Goldschmidt, Mr. George B",male,71.00,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.00,0,0,PC 17609,49.5042,NaN,C
851,852,0,3,"Svensson, Mr. Johan",male,74.00,0,0,347060,7.7750,NaN,S
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,0,0,27042,30.0000,A23,S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.00,0,0,347060,7.7750,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.00,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.00,0,0,PC 17609,49.5042,NaN,C
116,117,0,3,"Connors, Mr. Patrick",male,70.50,0,0,370369,7.7500,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C

df["Sex"].unique() devuelve un array con los valores √∫nicos de la columna sexo.

In [99]:
# Ejemplo 1: Valores √∫nicos en la columna sexo
display(df["Sex"].unique())

# Ejemplo 2: Valores √∫nicos en la columna edad
display(df["Age"].unique())

# Nos permite ver los diferentes datos que habr√° en nuestro array sin repeticiones

array(['male', 'female'], dtype=object)

array([22.        , 38.        , 26.        , 35.        , 29.69911765,
       54.        ,  2.        , 27.        , 14.        ,  4.        ,
       58.        , 20.        , 39.        , 55.        , 31.        ,
       34.        , 15.        , 28.        ,  8.        , 19.        ,
       40.        , 66.        , 42.        , 21.        , 18.        ,
        3.        ,  7.        , 49.        , 29.        , 65.        ,
       28.5       ,  5.        , 11.        , 45.        , 17.        ,
       32.        , 16.        , 25.        ,  0.83      , 30.        ,
       33.        , 23.        , 24.        , 46.        , 59.        ,
       71.        , 37.        , 47.        , 14.5       , 70.5       ,
       32.5       , 12.        ,  9.        , 36.5       , 51.        ,
       55.5       , 40.5       , 44.        ,  1.        , 61.        ,
       56.        , 50.        , 36.        , 45.5       , 20.5       ,
       62.        , 41.        , 52.        , 63.        , 23.5       ,
        0.92      , 43.        , 60.        , 10.        , 64.        ,
       13.        , 48.        ,  0.75      , 53.        , 57.        ,
       80.        , 70.        , 24.5       ,  6.        ,  0.67      ,
       30.5       ,  0.42      , 34.5       , 74.        ])

df["Pclass"].value_counts() cuenta cuantas veces aparecer√° cada valor en la columna Pclass

In [ ]:
# Ejemplo 1: Contar cu√°ntos pasajeros hay por clase
display(df["Pclass"].value_counts())

# Ejemplo 2: Mostrar el conteo ordenado de forma ascendente
display(df["Pclass"].value_counts(ascending=True))

# Nos permite ver, por ejemplo, el n√∫mero total de pasajeros en cada clase de manera r√°pida

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

Pclass
2    184
1    216
3    491
Name: count, dtype: int64


## ‚öôÔ∏è Step 7: Creating or Modifying Columns

Functions to explore:
- df.assign()
- df.apply()
- df["new_col"] = ...
- pd.concat()
- pd.merge()

df.assign() permite a√±adir una o m√°s columnas al data frame sin modificar el original

In [ ]:
# Ejemplo 1: Crear una nueva columna 'MitadEdad', es la edad a la mitad
display(df.assign(MitadEdad = df["Age"] / 2).head())

# Ejemplo 2: Crear dos columnas nuevas en una sola llamada
display(df.assign(
    MitadEdad = df["Age"] / 2,
    DobleEdad= df["Age"] * 2
).head())

# √ötil por si queremos a√±adir una o m√°s columnas de manera temporal a nuestro data frame

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,MitadEdad
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,11.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,19.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,13.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,17.5
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,17.5

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,MitadEdad,DobleEdad
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,11.0,44.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,19.0,76.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,13.0,52.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,17.5,70.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,17.5,70.0

df.apply() aplica una funci√≥n personalizada a una columna o fila de nuestro data frame

In [ ]:
# Ejemplo 1: Aplicar una funci√≥n a una columna (redondear el precio del pasaje)
display(df["Fare"].apply(lambda x: round(x, 1)))

# Ejemplo 2: Crear una nueva columna con apply
df["Age_Group"] = df["Age"].apply(lambda x: "Child" if x < 18 else "Adult")
display(df.head())

# nos permite crear nuevas columnas o filas cuando lo necesitemos, pudiendo aplicar diferente filtros o funciones

0       7.2
1      71.3
2       7.9
3      53.1
4       8.1
       ...
886    13.0
887    30.0
888    23.4
889    30.0
890     7.8
Name: Fare, Length: 891, dtype: float64

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Group
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Adult
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Adult
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Adult
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Adult
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Adult

df["new_col"]= nos permite crear o modificar una columna de nuestro data frame

In [ ]:
# Ejemplo 1: Crear una nueva columna con el doble del precio
df["Fare_Double"] = df["Fare"] * 2
display(df.head(10))

# Ejemplo 2: Crear una columna indicando si el pasajero es menor de edad
df["Is_Child"] = df["Age"] < 18
display(df.head(10))

# es una forma m√°s sencilla que las anteriores de crear columnas

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Group,Fare_Double,Is_Child
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S,Adult,14.5000,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C,Adult,142.5666,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S,Adult,15.8500,False
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S,Adult,106.2000,False
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S,Adult,16.1000,False
5,6,0,3,"Moran, Mr. James",male,29.699118,0,0,330877,8.4583,NaN,Q,Adult,16.9166,False
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S,Adult,103.7250,False
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,NaN,S,Child,42.1500,True
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.000000,0,2,347742,11.1333,NaN,S,Adult,22.2666,False
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1,0,237736,30.0708,NaN,C,Child,60.1416,True

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Group,Fare_Double,Is_Child
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S,Adult,14.5000,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C,Adult,142.5666,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S,Adult,15.8500,False
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S,Adult,106.2000,False
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S,Adult,16.1000,False
5,6,0,3,"Moran, Mr. James",male,29.699118,0,0,330877,8.4583,NaN,Q,Adult,16.9166,False
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S,Adult,103.7250,False
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,NaN,S,Child,42.1500,True
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.000000,0,2,347742,11.1333,NaN,S,Adult,22.2666,False
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1,0,237736,30.0708,NaN,C,Child,60.1416,True

pd.concat() sirve para unir varios data frames, mediante sus filas o columnas

In [ ]:
# Ejemplo 1: Unir dos DataFrames verticalmente (a√±adir filas)
df_part1 = df.head(3)
df_part2 = df.tail(3)
display(pd.concat([df_part1, df_part2]))

# Ejemplo 2: Unir horizontalmente (a√±adir columnas)
df_a = df[["Age", "Sex"]].head(3)
df_b = df[["Fare", "Survived"]].head(3)
display(pd.concat([df_a, df_b], axis=1))

# Lo usaremos cuando queramos queramos unir diferentes partes de un dataset con otro

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Group,Fare_Double,Is_Child
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S,Adult,14.5000,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C,Adult,142.5666,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S,Adult,15.8500,False
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,NaN,S,Adult,46.9000,False
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C,Adult,60.0000,False
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,NaN,Q,Adult,15.5000,False

    Age     Sex     Fare  Survived
0  22.0    male   7.2500         0
1  38.0  female  71.2833         1
2  26.0  female   7.9250         1

pd.merge() combina dos data frames en base a una om√°s columnas EN COM√öN.
Es parecido al JOIN de sql.

In [ ]:
# Ejemplo 1: Combinar dos DataFrames por una columna com√∫n
left = pd.DataFrame({
    "PassengerId": [1, 2, 3],
    "Age": [22, 38, 26]
})

right = pd.DataFrame({
    "PassengerId": [1, 2, 3],
    "Fare": [7.25, 71.83, 7.92]
})

display(pd.merge(left, right, on="PassengerId"))

# Ejemplo 2: Merge tipo 'inner', 'left', 'right' o 'outer'
display(pd.merge(left, right, on="PassengerId", how="outer"))

# Nos permite combinar informaci√≥n de diferentes fuentes.

   PassengerId  Age   Fare
0            1   22   7.25
1            2   38  71.83
2            3   26   7.92

   PassengerId  Age   Fare
0            1   22   7.25
1            2   38  71.83
2            3   26   7.92


## üíæ Step 8: Exporting Data

Function to explore:
- df.to_csv("output.csv", index=False)

df.to_csv("output.csv",index=False) guarda un data frame de pandas como un archivo CSV.

In [ ]:

# Example: Save cleaned data
df.to_csv("titanic_cleaned.csv", index=False)
# Con indx=False evitamos que la columna del √≠ndice de pandas se guarde en el archivo.


# Ejemplo 2: Exportar solo algunas columnas
df[["Name", "Sex", "Age", "Survived"]].to_csv("passengers_summary.csv", index=False)

# Muy √∫til si queremos importar los datos alterados del data frame que hemos estado utilizando, as√≠ podemos modificarlo en otros programas como excel o google sheets


## üß© Step 9: Summary

Reflect on what you learned:
- Which functions were most useful?
- What insights did you gain from the Titanic dataset?

En mi opini√≥n algunas de las funciones m√°s √∫tiles fueron:
- ".to_csv", ya que nos permite exportar nuestro trabajo a otros programas.
- ".query(), porque nos permite filtrar de manera r√°pida y sencilla los datos que queramos.
- "df["new_col"]=", porque nos permite crear columnas nuevas de forma sencilla y f√°cil de entender.

Con el ejercicio aprend√≠ a usar pandas, a un nivel b√°sico-medio (m√°s o menos creo yo), me recuerda en parte a sql en algunas cosas. Me ha parecido bastante entretenido, pero es verdad que a m√≠ siempre me gust√≥ sql y esto al ser algo "m√°s o menos" parecido pues le pongo m√°s ganas.